schreibfaul1/ESP32-audioI2S/src/Audio.h
/*
 * Audio.h
 *
 */

// #define SR_48K // I2S output always 48KHz

#pragma once
#pragma GCC optimize("Ofast")
#include "audiolib_structs.hpp"
#include "dsps_biquad.h"
#include "dsps_biquad_gen.h"
#include "esp_arduino_version.h"
#include "psram_unique_ptr.hpp"
#include <Arduino.h>
#include <FFat.h>
#include <FS.h>
#include <NetworkClient.h>
#include <NetworkClientSecure.h>
#include <SD.h>
#include <SD_MMC.h>
#include <WiFi.h>
#include <atomic>
#include <charconv>
#include <codecvt>
#include <deque>
#include <driver/i2s_std.h>
#include <esp32-hal-log.h>
#include <functional>
#include <libb64/cencode.h>
#include <locale>
#include <memory>
#include <span>
#include <vector>

#ifndef I2S_GPIO_UNUSED
    #define I2S_GPIO_UNUSED -1 // = I2S_PIN_NO_CHANGE in IDF < 5
#endif

extern __attribute__((weak)) void audio_process_i2s(int16_t* outBuff, int32_t validSamples, bool* continueI2S); // record audiodata or send via BT
extern char                       audioI2SVers[];
class Decoder; // prototype

// Audio event type descriptions
static constexpr std::array<const char*, 13> eventStr = {"info",    "id3data",  "eof",      "station_name", "icy_description", "streamtitle", "bitrate",
                                                         "icy_url", "icy_logo", "lasthost", "cover_image",  "lyrics",          "log"};
//----------------------------------------------------------------------------------------------------------------------
class AudioBuffer {

  public:
    AudioBuffer();   // constructor
    ~AudioBuffer();  // frees the buffer
    size_t   init(); // set default values
    bool     isInitialized() { return m_init; };
    size_t   getBufsize();
    size_t   getMaxBlockSize(); // returns maxBlockSize
    void     setMaxBlocksize(uint32_t mbs);
    size_t   freeSpace();             // number of free bytes to overwrite
    size_t   writeSpace();            // space fom writepointer to bufferend
    size_t   bufferFilled();          // returns the number of filled bytes
    size_t   readSpace();             // max readable bytes in one block
    void     bytesWritten(size_t bw); // update writepointer
    void     bytesWasRead(size_t br); // update readpointer
    uint8_t* getWritePtr();           // returns the current writepointer
    uint8_t* getReadPtr();            // returns the current readpointer
    void     reset();                 // restore defaults
    void     showStatus();

  protected:
    size_t          m_mainBuffSize = 0; // most webstreams limit the advance to 100...300Kbytes
    size_t          m_freeSpace = 0;
    size_t          m_writeSpace = 0;
    size_t          m_resBuffSize = 0;
    size_t          m_maxBlockSize = 0;
    size_t          m_readSpace = 0;
    const size_t    m_maxRet = UINT16_MAX;
    ps_ptr<uint8_t> m_buffer;
    uint8_t*        m_buffEnd = nullptr;
    uint8_t*        m_writePtr = nullptr;
    uint8_t*        m_readPtr = nullptr;
    uint8_t*        m_endPtr = nullptr;
    uint8_t*        m_startPtr = nullptr;
    bool            m_init = false;
    bool            m_isEmpty = true;
    bool            m_isFull = false;

  private:
    SemaphoreHandle_t m_mutex = nullptr;
};

//----------------------------------------------------------------------------------------------------------------------
class StereoAudioEqualizer {

  private:
    typedef enum { LEFTCHANNEL = 0, RIGHTCHANNEL = 1 } SampleIndex;
    typedef enum { LOWSHELF = 0, PEAKINGEQ = 1, HIFGSHELF = 2 } FilterType;

#define BLOCK_SAMPLES 64              // Frames (Stereo!)
    float m_block[BLOCK_SAMPLES * 2]; // interleaved L/R

    float                   m_coeffs[3][5] = {0};
    uint8_t                 m_bps = 0;
    uint8_t                 m_VUl_cnt0 = 0;
    uint8_t                 m_VUl_cnt1 = 0;
    uint8_t                 m_VUl_cnt2 = 0;
    uint8_t                 m_VUl_cnt3 = 0;
    uint8_t                 m_VUl_cnt4 = 0;
    uint8_t                 m_sampleArray[2][4][8] = {0};
    uint8_t                 m_vuLeft = 0;
    uint8_t                 m_vuRight = 0;
    bool                    m_f_vu = false;
    audiolib::audio_items_t m_items;
    float                   m_limiter[2] = {1};

  private:
    float m_state_biquad[3][4] = {0};

  public:
    StereoAudioEqualizer();
    ~StereoAudioEqualizer() {}
    void     reset();
    uint16_t getVUlevel();
    void     computeVUlevel(int16_t* sample);
    void     update_audio_items(audiolib::audio_items_t gain, uint32_t sampleRate, uint8_t bps);
    void     process(int32_t* buff, uint16_t numSamples);

  private:
    void calculateVolumeLimits(); // balance and gain
    void filter_block(float* block, int frames);
    void Gain16(int16_t* sample);
    void Gain32(int32_t* sample);
};
//----------------------------------------------------------------------------------------------------------------------

class Audio {
  private:
    AudioBuffer          InBuff; // instance of input buffer
    StereoAudioEqualizer equalizer;
    uint8_t              m_i2s_num; // I2S_NUM_0 or I2S_NUM_1

  public:
    Audio(uint8_t i2sPort = I2S_NUM_0);
    ~Audio();
    std::mutex mutex_info; // mutex_info as member

    // callbacks ---------------------------------------------------------
    typedef enum { evt_info = 0, evt_id3data, evt_eof, evt_name, evt_icydescription, evt_streamtitle, evt_bitrate, evt_icyurl, evt_icylogo, evt_lasthost, evt_image, evt_lyrics, evt_log } event_t;
    typedef struct _msg { // used in info(audio_info_callback());
        const char*           msg = nullptr;
        const char*           s = nullptr;
        event_t               e = (event_t)0; // event type
        uint8_t               i2s_num = 0;
        int32_t               arg1 = 0;
        int32_t               arg2 = 0;
        std::vector<uint32_t> vec = {}; // apic [pos, len, pos, len, pos, len, ....]
    } msg_t;
    inline static std::function<void(msg_t i)> audio_info_callback;
    // -------------------------------------------------------------------

