schreibfaul1/ESP32-audioI2S/src/Audio.h
    const uint16_t m_plsBuffEntryLen = 256;        // length of each entry in playlistBuff
    int            m_LFcount = 0;                  // Detection of end of header
    uint32_t       m_sampleRate = 48000;           //
    uint32_t       m_avr_bitrate = 0;              // average bitrate, median calculated by VBR
    uint32_t       m_nominal_bitrate = 0;          // given br from header
    uint32_t       m_audioFilePosition = 0;        // current position, counts every readed byte
    uint32_t       m_audioDataReadPtr = 0;         // used in playAudioData
    uint32_t       m_audioFileSize = 0;            // local and web files
    int            m_readbytes = 0;                // bytes read
    uint32_t       m_metacount = 0;                // counts down bytes between metadata
    int            m_controlCounter = 0;           // Status within readID3data() and readWaveHeader()
    int16_t        m_inputHistory[6] = {0};        // used in resampleTo48kStereo()
    uint16_t       m_opus_mode = 0;                // celt_only, silk_only or hybrid
    uint8_t        m_timeoutCounter = 0;           // timeout counter
    uint8_t        m_bitsPerSample = 16;           // bitsPerSample
    uint8_t        m_channels = 2;                 // (1) mono, (2) stereo
    uint8_t        m_playlistFormat = 0;           // M3U, PLS, ASX
    uint8_t        m_codec = CODEC_NONE;           //
    uint8_t        m_m3u8Codec = CODEC_AAC;        // codec of m3u8 stream
    uint8_t        m_expectedCodec = CODEC_NONE;   // set in connecttohost (e.g. http://url.mp3 -> CODEC_MP3)
    uint8_t        m_expectedPlsFmt = FORMAT_NONE; // set in connecttohost (e.g. streaming01.m3u) -> FORMAT_M3U)
    uint8_t        m_streamType = ST_NONE;
    uint8_t        m_ID3Size = 0; // lengt of ID3frame - ID3header
    uint8_t        m_vuLeft = 0;  // average value of samples, left channel
    uint8_t        m_vuRight = 0; // average value of samples, right channel
    uint8_t        m_audioTaskCoreId = 0;
    uint8_t        m_M4A_objectType = 0; // set in read_M4A_Header
    uint8_t        m_M4A_chConfig = 0;   // set in read_M4A_Header
    uint16_t       m_M4A_sampleRate = 0; // set in read_M4A_Header
    int16_t        m_validSamples = 0;
    int16_t        m_curSample = 0;
    uint16_t       m_dataMode = 0;        // Statemaschine
    uint16_t       m_streamTitleHash = 0; // remember streamtitle, ignore multiple occurence in metadata
    uint16_t       m_timeout_ms = 250;
    uint16_t       m_timeout_ms_ssl = 2700;
    uint32_t       m_metaint = 0;              // Number of databytes between metadata
    uint32_t       m_chunkcount = 0;           // Counter for chunked transfer
    uint32_t       m_t0 = 0;                   // store millis(), is needed for a small delay
    uint32_t       m_bytesNotConsumed = 0;     // pictures or something else that comes with the stream
    uint64_t       m_lastGranulePosition = 0;  // necessary to calculate the duration in OPUS and VORBIS
    int32_t        m_resumeFilePos = -1;       // the return value from stopSong(), (-1) is idle
    int32_t        m_fileStartTime = -1;       // may be set in connecttoFS()
    uint16_t       m_m3u8_targetDuration = 10; //
    uint32_t       m_stsz_numEntries = 0;      // num of entries inside stsz atom (uint32_t)
    uint32_t       m_stsz_position = 0;        // pos of stsz atom within file
    uint32_t       m_haveNewFilePos = 0;       // user changed the file position
    bool           m_f_metadata = false;       // assume stream without metadata
    bool           m_f_unsync = false;         // set within ID3 tag but not used
    bool           m_f_exthdr = false;         // ID3 extended header
    bool           m_f_ssl = false;
    bool           m_f_running = false;
    bool           m_f_firstCall = false;         // InitSequence for processWebstream and processLokalFile
    bool           m_f_firstLoop = false;         // InitSequence in loop()
    bool           m_f_firstPlayCall = false;     // InitSequence for playAudioData
    bool           m_f_ID3v1TagFound = false;     // ID3v1 tag found
    bool           m_f_chunked = false;           // Station provides chunked transfer
    bool           m_f_firstmetabyte = false;     // True if first metabyte (counter)
    bool           m_f_playing = false;           // valid mp3 stream recognized
    bool           m_f_tts = false;               // text to speech
    bool           m_f_ogg = false;               // OGG stream
    bool           m_f_forceMono = false;         // if true stereo -> mono
    bool           m_f_rtsp = false;              // set if RTSP is used (m3u8 stream)
    bool           m_f_m3u8data = false;          // used in processM3U8entries
    bool           m_f_continue = false;          // next m3u8 chunk is available
    bool           m_f_ts = true;                 // transport stream
    bool           m_f_m4aID3dataAreRead = false; // has the m4a-ID3data already been read?
    bool           m_f_psramFound = false;        // set in constructor, result of psramInit()
    bool           m_f_timeout = false;           //
    bool           m_f_commFMT = false;           // false: default (PHILIPS), true: Least Significant Bit Justified (japanese format)
    bool           m_f_audioTaskIsRunning = false;
    bool           m_f_allDataReceived = false;
    bool           m_f_stream = false;       // stream ready for output?
    bool           m_f_decode_ready = false; // if true data for decode are ready
    bool           m_f_eof = false;          // end of file
    bool           m_f_lockInBuffer = false; // lock inBuffer for manipulation
    bool           m_f_audioTaskIsDecoding = false;
    bool           m_f_acceptRanges = false;
    bool           m_f_reset_m3u8Codec = true;      // reset codec for m3u8 stream
    bool           m_f_connectionClose = false;     // set in parseHttpResponseHeader
    bool           m_f_i2s_channel_enabled = false; // true if enabled
    uint32_t       m_audioFileDuration = 0;         // seconds
    uint32_t       m_audioCurrentTime = 0;          // seconds
    float          m_resampleError = 0.0f;
    float          m_resampleRatio = 1.0f;  // resample ratio for e.g. 44.1kHz to 48kHz
    float          m_resampleCursor = 0.0f; // next frac in resampleTo48kStereo

    uint32_t m_audioDataStart = 0;   // in bytes
    size_t   m_audioDataSize = 0;    //
    size_t   m_ibuffSize = 0;        // log buffer size for audio_info()
    size_t   m_i2s_bytesWritten = 0; // set in i2s_write() but not used

    pid_array m_pidsOfPMT;
    int16_t   m_pidOfAAC;
    uint8_t   m_packetBuff[m_tsPacketSize];
    int16_t   m_pesDataLength = 0;

    // audiolib structs
    audiolib::ID3Hdr_t      m_ID3Hdr;
    audiolib::pwsHLS_t      m_pwsHLS;
    audiolib::pplM3u8_t     m_pplM3U8;
    audiolib::m4aHdr_t      m_m4aHdr;
    audiolib::plCh_t        m_plCh;
    audiolib::lVar_t        m_lVar;
    audiolib::prlf_t        m_prlf;
    audiolib::cat_t         m_cat;
    audiolib::cVUl_t        m_cVUl;
    audiolib::ifCh_t        m_ifCh;
    audiolib::tspp_t        m_tspp;
    audiolib::pwst_t        m_pwst;
    audiolib::gchs_t        m_gchs;
    audiolib::pwf_t         m_pwf;
    audiolib::pad_t         m_pad;
    audiolib::sbyt_t        m_sbyt;
    audiolib::rmet_t        m_rmet;
    audiolib::pwsts_t       m_pwsst;
    audiolib::rwh_t         m_rwh;
    audiolib::rflh_t        m_rflh;
    audiolib::phreh_t       m_phreh;
    audiolib::phrah_t       m_phrah;
    audiolib::sdet_t        m_sdet;
    audiolib::fnsy_t        m_fnsy;
    audiolib::audio_items_t m_audio_items;

    // —————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
  public:
    // 🎯 overload for char*-Pointer (maybe nullptr)
    static const char* safe_arg(const char* v) { return v ? v : "(null)"; }
    static char*       safe_arg(char* v) { return v ? v : (char*)"(null)"; }

    // 🎯 overload for char-Arrays (never nullptr)
    template <size_t N> static const char* safe_arg(const char (&v)[N]) { return v; }

    // 🎯 overload for string
    static const char* safe_arg(const std::string& v) { return v.c_str(); }

    // 🎯 overload for string_view
    static const char* safe_arg(std::string_view v) {
        return v.data(); // Achtung: evtl. nicht nullterminiert
    }

    // 🎯 Catch-all for all other types
    template <typename T> static auto safe_arg(T&& v) -> decltype(auto) { return std::forward<T>(v); }

    // specialization for nullptr / NULL
    static const char* safe_arg(std::nullptr_t) { return "(null)"; }

    template <typename... Args> static bool info(Audio& instance, event_t e, const char* fmt, Args&&... args) {
        std::lock_guard<std::mutex> lock(instance.mutex_info); // lock mutex
                                                               // -------------------------------------------------------------------------------------------------------------------
        auto extract_last_number = [](std::string_view s) -> int32_t {
            // start from the back
            auto it = s.end();
            // skip whitespaces at the end (if available)
            while (it != s.begin() && std::isspace(static_cast<unsigned char>(*(it - 1)))) { --it; }

            auto end = it; // potential end of the number

            // Now only search digits backwards
            while (it != s.begin() && std::isdigit(static_cast<unsigned char>(*(it - 1)))) { --it; }

            // Check: is there a space before it?
            if (it != s.begin() && std::isspace(static_cast<unsigned char>(*(it - 1)))) {
                std::string_view number{it, static_cast<size_t>(end - it)};
                uint32_t         value{};
                auto [p, ec] = std::from_chars(number.data(), number.data() + number.size(), value);
                if (ec == std::errc{}) { return static_cast<int32_t>(value); }
            }

            return -1; // no number found in the end
        };
        // -------------------------------------------------------------------------------------------------------------------
        if (!fmt) return false;
        if (!audio_info_callback) return false;
        ps_ptr<char> result;
        // First run: determine size
        int len = std::snprintf(nullptr, 0, fmt, safe_arg(std::forward<Args>(args))...);
        if (len <= 0) return false;
        result.calloc(len + 1);
        char* p = result.get();
        if (!p) return false;
        std::snprintf(p, len + 1, fmt, safe_arg(std::forward<Args>(args))...);
        msg_t i = {0};
        i.msg = result.c_get();
        i.e = e;
        i.s = eventStr[e];
        i.arg1 = extract_last_number(result.c_get());
        i.i2s_num = instance.m_i2s_num;
        audio_info_callback(i);
        result.reset();
        return true;
    }

